text.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
    <soap12:Body>
        <GrabaServicios xmlns="http://www.asmred.com/">
            <docIn >
                <Servicios uidcliente="6BAB7A53-3B6D-4D5A-9450-702D2FAC0B11" xmlns="http://www.asmred.com/">
                    <Envio codbarras="" >
                        <Fecha>14/08/2014</Fecha>
                        <Portes>P</Portes>
                        <Servicio>1</Servicio>
                        <Horario>3</Horario>
                        <Bultos>1</Bultos>
                        <Peso>1</Peso>
                        <Retorno>0</Retorno>
                        <Pod>N</Pod>
                        <Remite>
                            <Plaza></Plaza>
                            <Nombre>ARG Solutions</Nombre>
                            <Direccion>C/Dolca de Provenca 2222</Direccion>
                            <Poblacion>Premia de Dalt</Poblacion>
                            <Provincia>Barcelona</Provincia>
                            <Pais>34</Pais>
                            <CP>08338</CP>
                            <Telefono>961111111</Telefono>
                        </Remite>
                        <Destinatario>
                            <Codigo></Codigo>
                            <Plaza></Plaza>
                            <Nombre>Mr Test</Nombre>
                            <Direccion>Calle Juan Esplandi 513b</Direccion>
                            <Poblacion>Madrid</Poblacion>
                            <Provincia>Madrid</Provincia>
                            <Pais>34</Pais>
                            <CP>280007</CP>
        
                        </Destinatario>
                        <DevuelveAdicionales>
                            <Etiqueta tipo="PDF"></Etiqueta>
                        </DevuelveAdicionales>
                    </Envio>
                </Servicios>
            </docIn>
        </GrabaServicios>
    </soap12:Body>
</soap12:Envelope>